Repository: jorgeRumilly/Sj4web_PaymentDiscount
Catalog: translations/*/ModulesSj4webPaymentdiscountAdmin.*.xlf
Languages: fr_fr

source: SJ4WEB - Payment Discount Sync
fr_fr: SJ4WEB - Synchronisation Réduction Paiement

source: Automatically applies/removes discount based on cart total and payment method.
fr_fr: Applique/retire automatiquement une réduction selon le total du panier et le mode de paiement.

source: Configuration saved successfully
fr_fr: Configuration sauvegardée avec succès

source: Error during save
fr_fr: Erreur lors de la sauvegarde

source: Module Status
fr_fr: Statut du module

source: Optimal mode
fr_fr: Mode optimal

source: Degraded mode
fr_fr: Mode dégradé

source: Cart.php override installed and working
fr_fr: Override Cart.php installé et fonctionnel

source: Cart.php override not installed
fr_fr: Override Cart.php non installé

source: The module works but with reduced precision on total calculations.
fr_fr: Le module fonctionne mais avec une précision réduite sur le calcul des totaux.

source: Payment Discount Configuration
fr_fr: Configuration Réduction Paiement

source: Discount voucher code
fr_fr: Code du bon de réduction

source: Code of the existing discount voucher in PrestaShop
fr_fr: Code du bon de réduction existant dans PrestaShop

source: Minimum threshold
fr_fr: Seuil minimum

source: Minimum cart amount to apply the discount
fr_fr: Montant minimum du panier pour appliquer la réduction

source: Allowed payment modules
fr_fr: Modules de paiement autorisés

source: One module per line.
fr_fr: Un module par ligne.

source: Examples: payplug, ps_wirepayment, paypal, stripe, etc.
fr_fr: Exemples : payplug, ps_wirepayment, paypal, stripe, etc.

source: Debug mode
fr_fr: Mode debug

source: Enable detailed logs for debugging
fr_fr: Active les logs détaillés pour le débogage

source: Enabled
fr_fr: Activé

source: Disabled
fr_fr: Désactivé

source: Save
fr_fr: Sauvegarder

source: Cancel
fr_fr: Annuler

source: Help & Documentation
fr_fr: Aide & Documentation

source: Discount voucher configuration
fr_fr: Configuration du bon de réduction

source: The discount voucher must be created in:
fr_fr: Le bon de réduction doit être créé dans :

source: Promotion > Cart Rules
fr_fr: Promotion > Règles panier

source: Same as configured above
fr_fr: Le même que configuré ci-dessus

source: Amount or percentage according to your choice
fr_fr: Montant ou pourcentage selon votre choix

# 77b7c4d806c8c11c8c8c8c8c8c8c8c8g
source: Status
fr_fr: Statut

# 77b7c4d806c8c11c8c8c8c8c8c8c8c8h
source: Active
fr_fr: Actif

# 77b7c4d806c8c11c8c8c8c8c8c8c8c8i
source: Payment modules
fr_fr: Modules de paiement

# 77b7c4d806c8c11c8c8c8c8c8c8c8c8j
source: Technical names of installed modules:
fr_fr: Noms techniques des modules installés :

source: The discount voucher code is required
fr_fr: Le code du bon de réduction est obligatoire

source: The minimum threshold must be greater than 0
fr_fr: Le seuil minimum doit être supérieur à 0

source: At least one payment module must be specified
fr_fr: Au moins un module de paiement doit être spécifié

source: Warning: Discount voucher "%code%" does not exist in PrestaShop
fr_fr: Attention : Le bon de réduction "%code%" n'existe pas dans PrestaShop

source: Invalid format for payment modules
fr_fr: Format invalide pour les modules de paiement

source: Cart.php override - Degraded mode enabled
fr_fr: Override Cart.php - Mode dégradé activé

source: Existing Cart.php override is non-standard
fr_fr: L'override Cart.php existant n'est pas standard

source: Unable to automatically add the hook. Manual instructions required.
fr_fr: Impossible d'ajouter automatiquement le hook. Instructions manuelles nécessaires.

source: Hook ignored - non-payment context
fr_fr: Hook ignoré - contexte non-paiement

source: Hook ignored - no payment module detected
fr_fr: Hook ignoré - aucun module de paiement détecté

source: Hook ignored - system module detected: %s
fr_fr: Hook ignoré - module système détecté : %s

source: Discount removed at validation, payment: %s
fr_fr: Bon retiré à la validation, paiement : %s

source: Total recalculated via hook (payment %payment% not allowed) - discount cancelled: %amount%
fr_fr: Total recalculé via hook (paiement %payment% non autorisé) - réduction annulée : %amount%

source: Discount removed (degraded mode, payment: %s)
fr_fr: Bon retiré (mode dégradé, paiement : %s)

source: Module detected via Tools::getValue('module'): %s
fr_fr: Module détecté via Tools::getValue('module') : %s

source: Module detected via payment-option: %s
fr_fr: Module détecté via payment-option : %s

source: Module detected via fc: %s
fr_fr: Module détecté via fc : %s

source: Module detected via cookie: %s
fr_fr: Module détecté via cookie : %s

source: No payment module detected
fr_fr: Aucun module de paiement détecté

source: Configuration updated - Code: %code%, Threshold: %threshold%, Modules: %modules%, Debug: %debug%
fr_fr: Configuration mise à jour - Code : %code%, Seuil : %threshold%, Modules : %modules%, Debug : %debug%

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Bank wire
fr_fr: Virement bancaire

source: Toggle - Payment: %payment%, Allowed: %allowed%, Total: %total%, Threshold: %threshold%, Should have: %should%, Has: %has%
fr_fr: Toggle - Paiement : %payment%, Autorisé : %allowed%, Total : %total%, Seuil : %threshold%, Devrait avoir : %should%, A : %has%

source: Discount added (authorized payment: %payment%)
fr_fr: Réduction ajoutée (paiement autorisé : %payment%)

source: Discount removed (unauthorized payment: %payment% or threshold not reached)
fr_fr: Réduction retirée (paiement non autorisé : %payment% ou seuil non atteint)

source: Toggle Error: %error%
fr_fr: Erreur Toggle : %error%

source: One module per line. Use module:subtype for detailed control.
fr_fr: Un module par ligne. Utilisez module:sous-type pour un contrôle détaillé.

source: PayPlug examples:
fr_fr: Exemples PayPlug :

source: Credit card only
fr_fr: Carte bancaire uniquement

source: Apple Pay only
fr_fr: Apple Pay uniquement

source: Oney 3x payment
fr_fr: Paiement Oney 3x

source: Oney 4x payment
fr_fr: Paiement Oney 4x

source: Other modules:
fr_fr: Autres modules :

source: PayPlug supports multiple payment methods. You can configure each one specifically:
fr_fr: PayPlug supporte plusieurs moyens de paiement. Tu peux configurer chacun spécifiquement :

source: Standard credit card
fr_fr: Carte bancaire standard

source: Mobile payments (Apple Pay, Google Pay)
fr_fr: Paiements mobiles (Apple Pay, Google Pay)

source: Oney installment payments (3x, 4x)
fr_fr: Paiements échelonnés Oney (3x, 4x)

source: Detection examples
fr_fr: Exemples de détection

source: The module automatically detects PayPlug variants:
fr_fr: Le module détecte automatiquement les variantes PayPlug :

source: Forms with method=standard → payplug:standard
fr_fr: Formulaires avec method=standard → payplug:standard

source: Labels with "Apple Pay" → payplug:applepay
fr_fr: Libellés avec "Apple Pay" → payplug:applepay

source: Labels with "3x sans frais" → payplug:oney_x3_without_fees
fr_fr: Libellés avec "3x sans frais" → payplug:oney_x3_without_fees

source: Configuration examples
fr_fr: Exemples de configuration

source: Allow only credit card and wire transfer:
fr_fr: Autoriser seulement la carte bancaire et le virement :

source: Allow all PayPlug methods:
fr_fr: Autoriser tous les moyens PayPlug :

source: Exclude Oney payments only:
fr_fr: Exclure seulement les paiements Oney :

source: Troubleshooting
fr_fr: Résolution de problèmes

source: If automatic detection doesn't work:
fr_fr: Si la détection automatique ne fonctionne pas :

source: Enable debug mode to see detection logs
fr_fr: Active le mode debug pour voir les logs de détection

source: Check browser console for JavaScript errors
fr_fr: Vérifie la console du navigateur pour les erreurs JavaScript

source: Check logs in PrestaShop > Advanced Parameters > Logs
fr_fr: Vérifie les logs dans PrestaShop > Paramètres avancés > Logs

source: Custom Message BEFORE Tier (Optional)
fr_fr: Message personnalisé AVANT palier (optionnel)

source: Message displayed BEFORE reaching this tier. Tokens: {amount}, {discount}, {threshold}. E.g., "Plus que {amount}€ pour {discount} si paiement CB ou virement"
fr_fr: Message affiché AVANT d'atteindre ce palier. Tokens : {amount}, {discount}, {threshold}. Ex : "Plus que {amount}€ pour {discount} si paiement CB ou virement"

source: If empty, the global message from sj4webtofreedelivery module will be used.
fr_fr: Si vide, le message global du module sj4webtofreedelivery sera utilisé.

source: Custom Message AFTER Tier (Optional)
fr_fr: Message personnalisé APRÈS palier (optionnel)

source: Message displayed AFTER reaching this tier. Tokens: {discount}. E.g., "Vous bénéficiez de {discount} (CB ou virement)"
fr_fr: Message affiché APRÈS avoir atteint ce palier. Tokens : {discount}. Ex : "Vous bénéficiez de {discount} (CB ou virement)"
